HotelReception/src/ClientSurvey.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="ClientSurvey" targetNamespace="http://j2ee.netbeans.org/wsdl/HotelReception/ClientSurvey"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/HotelReception/ClientSurvey" xmlns:ns="http://xml.netbeans.org/schema/Exchanges" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:ns0="http://xml.netbeans.org/schema/hotel">
    <types>
        <xsd:schema targetNamespace="http://j2ee.netbeans.org/wsdl/HotelReception/ClientSurvey">
            <xsd:import namespace="http://xml.netbeans.org/schema/hotel" schemaLocation="hotel.xsd"/>
        </xsd:schema>
    </types>
    <message name="ClientSurveyOperationRequest">
        <part name="clientRequest" type="ns0:ScubaDivingRequest"/>
    </message>
    <message name="ClientSurveyOperationResponse">
        <part name="clientResponse" type="ns0:ScubaDivingBooking"/>
    </message>
    <portType name="ClientSurveyPortType">
        <operation name="ClientSurveyOperation">
            <input name="input1" message="tns:ClientSurveyOperationRequest"/>
            <output name="output1" message="tns:ClientSurveyOperationResponse"/>
        </operation>
    </portType>
    <plnk:partnerLinkType name="ClientSurvey">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes.
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="ClientSurveyPortTypeRole" portType="tns:ClientSurveyPortType"/>
    </plnk:partnerLinkType>
</definitions>



